GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q84.inc
T4CLKCON         EQU  H'0332'
T4CLK            EQU  H'0332'
T4RST            EQU  H'0333'
TMR5             EQU  H'0334'
TMR5L            EQU  H'0334'
TMR5H            EQU  H'0335'
T5CON            EQU  H'0336'
TMR5CON          EQU  H'0336'
T5GCON           EQU  H'0337'
TMR5GCON         EQU  H'0337'
T5GATE           EQU  H'0338'
TMR5GATE         EQU  H'0338'
T5CLK            EQU  H'0339'
TMR5CLK          EQU  H'0339'
PR5              EQU  H'0339'
T6TMR            EQU  H'033A'
TMR6             EQU  H'033A'
T6PR             EQU  H'033B'
PR6              EQU  H'033B'
T6CON            EQU  H'033C'
T6HLT            EQU  H'033D'
T6CLKCON         EQU  H'033E'
T6CLK            EQU  H'033E'
T6RST            EQU  H'033F'
CCPR1            EQU  H'0340'
CCPR1L           EQU  H'0340'
CCPR1H           EQU  H'0341'
CCP1CON          EQU  H'0342'
CCP1CAP          EQU  H'0343'
CCPR2            EQU  H'0344'
CCPR2L           EQU  H'0344'
CCPR2H           EQU  H'0345'
CCP2CON          EQU  H'0346'
CCP2CAP          EQU  H'0347'
CCPR3            EQU  H'0348'
CCPR3L           EQU  H'0348'
CCPR3H           EQU  H'0349'
CCP3CON          EQU  H'034A'
CCP3CAP          EQU  H'034B'
CCPTMRS0         EQU  H'034C'
CRCDATA          EQU  H'034F'
CRCDATAL         EQU  H'034F'
CRCDATAH         EQU  H'0350'
CRCDATAU         EQU  H'0351'
CRCDATAT         EQU  H'0352'
CRCOUT           EQU  H'0353'
CRCSHFT          EQU  H'0353'
CRCXOR           EQU  H'0353'
CRCOUTL          EQU  H'0353'
CRCSHFTL         EQU  H'0353'
CRCSHIFTL        EQU  H'0353'
CRCXORL          EQU  H'0353'
CRCOUTH          EQU  H'0354'
CRCSHFTH         EQU  H'0354'
CRCSHIFTH        EQU  H'0354'
CRCXORH          EQU  H'0354'
CRCOUTU          EQU  H'0355'
CRCSHFTU         EQU  H'0355'
CRCSHIFTU        EQU  H'0355'
CRCXORU          EQU  H'0355'
CRCOUTT          EQU  H'0356'
CRCSHFTT         EQU  H'0356'
CRCSHIFTT        EQU  H'0356'
CRCXORT          EQU  H'0356'
CRCCON0          EQU  H'0357'
CRCCON1          EQU  H'0358'
CRCCON2          EQU  H'0359'
SCANLADR         EQU  H'035A'
SCANLADRL        EQU  H'035A'
SCANLADRH        EQU  H'035B'
SCANLADRU        EQU  H'035C'
SCANHADR         EQU  H'035D'
SCANHADRL        EQU  H'035D'
SCANHADRH        EQU  H'035E'
SCANHADRU        EQU  H'035F'
SCANCON0         EQU  H'0360'
SCANTRIG         EQU  H'0361'
IPR0             EQU  H'0362'
IPR1             EQU  H'0363'
IPR2             EQU  H'0364'
IPR3             EQU  H'0365'
IPR4             EQU  H'0366'
IPR5             EQU  H'0367'
IPR6             EQU  H'0368'
IPR7             EQU  H'0369'
IPR8             EQU  H'036A'
IPR9             EQU  H'036B'
IPR10            EQU  H'036C'
IPR11            EQU  H'036D'
IPR12            EQU  H'036E'
IPR13            EQU  H'036F'
IPR14            EQU  H'0370'
IPR15            EQU  H'0371'
STATUS_CSHAD     EQU  H'0373'
WREG_CSHAD       EQU  H'0374'
BSR_CSHAD        EQU  H'0375'
SHADCON          EQU  H'0376'
STATUS_SHAD      EQU  H'0377'
WREG_SHAD        EQU  H'0378'
BSR_SHAD         EQU  H'0379'
PCLATH_SHAD      EQU  H'037A'
PCLATU_SHAD      EQU  H'037B'
FSR0SH           EQU  H'037C'
FSR0L_SHAD       EQU  H'037C'
FSR0H_SHAD       EQU  H'037D'
FSR1SH           EQU  H'037E'
FSR1L_SHAD       EQU  H'037E'
FSR1H_SHAD       EQU  H'037F'
FSR2SH           EQU  H'0380'
FSR2L_SHAD       EQU  H'0380'
FSR2H_SHAD       EQU  H'0381'
PRODSH           EQU  H'0382'
PRODL_SHAD       EQU  H'0382'
PRODH_SHAD       EQU  H'0383'
TU16ACON0        EQU  H'0387'
TU16ACON1        EQU  H'0388'
TU16AHLT         EQU  H'0389'
TU16APS          EQU  H'038A'
TU16ATMR         EQU  H'038B'
TU16ACR          EQU  H'038B'
TU16ATMRL        EQU  H'038B'
TU16ACRL         EQU  H'038B'
TU16ATMRH        EQU  H'038C'
TU16ACRH         EQU  H'038C'
TU16APR          EQU  H'038D'
TU16APRL         EQU  H'038D'
TU16APRH         EQU  H'038E'
TU16ACLK         EQU  H'038F'
TU16AERS         EQU  H'0390'
TU16BCON0        EQU  H'0393'
TU16BCON1        EQU  H'0394'
TU16BHLT         EQU  H'0395'
TU16BPS          EQU  H'0396'
TU16BTMR         EQU  H'0397'
TU16BCR          EQU  H'0397'
TU16BTMRL        EQU  H'0397'
TU16BCRL         EQU  H'0397'
TU16BTMRH        EQU  H'0398'
TU16BCRH         EQU  H'0398'
TU16BPR          EQU  H'0399'
TU16BPRL         EQU  H'0399'
TU16BPRH         EQU  H'039A'
TU16BCLK         EQU  H'039B'
TU16BERS         EQU  H'039C'
TUCHAIN          EQU  H'03BB'
CWG1CLK          EQU  H'03BC'
CWG1CLKCON       EQU  H'03BC'
CWG1ISM          EQU  H'03BD'
CWG1DBR          EQU  H'03BE'
CWG1DBF          EQU  H'03BF'
CWG1CON0         EQU  H'03C0'
CWG1CON1         EQU  H'03C1'
CWG1AS0          EQU  H'03C2'
CWG1AS1          EQU  H'03C3'
CWG1STR          EQU  H'03C4'
CWG2CLK          EQU  H'03C5'
CWG2CLKCON       EQU  H'03C5'
CWG2ISM          EQU  H'03C6'
CWG2DBR          EQU  H'03C7'
CWG2DBF          EQU  H'03C8'
CWG2CON0         EQU  H'03C9'
CWG2CON1         EQU  H'03CA'
CWG2AS0          EQU  H'03CB'
CWG2AS1          EQU  H'03CC'
CWG2STR          EQU  H'03CD'
CWG3CLK          EQU  H'03CE'
CWG3CLKCON       EQU  H'03CE'
CWG3ISM          EQU  H'03CF'
CWG3DBR          EQU  H'03D0'
CWG3DBF          EQU  H'03D1'
CWG3CON0         EQU  H'03D2'
CWG3CON1         EQU  H'03D3'
CWG3AS0          EQU  H'03D4'
CWG3AS1          EQU  H'03D5'
CWG3STR          EQU  H'03D6'
FVRCON           EQU  H'03D7'
ADCPCON          EQU  H'03D8'
ADCP             EQU  H'03D8'
ADLTH            EQU  H'03D9'
ADLTHL           EQU  H'03D9'
ADLTHH           EQU  H'03DA'
ADUTH            EQU  H'03DB'
ADUTHL           EQU  H'03DB'
ADUTHH           EQU  H'03DC'
ADERR            EQU  H'03DD'
ADERRL           EQU  H'03DD'
ADERRH           EQU  H'03DE'
ADSTPT           EQU  H'03DF'
ADSTPTL          EQU  H'03DF'
ADSTPTH          EQU  H'03E0'
ADFLTR           EQU  H'03E1'
ADFLTRL          EQU  H'03E1'
ADFLTRH          EQU  H'03E2'
ADACC            EQU  H'03E3'
ADACCL           EQU  H'03E3'
ADACCH           EQU  H'03E4'
ADACCU           EQU  H'03E5'
ADCNT            EQU  H'03E6'
ADRPT            EQU  H'03E7'
ADPREV           EQU  H'03E8'
ADPREVL          EQU  H'03E8'
ADPREVH          EQU  H'03E9'
ADRES            EQU  H'03EA'
ADRESL           EQU  H'03EA'
ADRESH           EQU  H'03EB'
ADPCH            EQU  H'03EC'
ADACQ            EQU  H'03EE'
ADACQL           EQU  H'03EE'
ADACQH           EQU  H'03EF'
ADCAP            EQU  H'03F0'
ADPRE            EQU  H'03F1'
ADPREL           EQU  H'03F1'
ADPREH           EQU  H'03F2'
ADCON0           EQU  H'03F3'
ADCON1           EQU  H'03F4'
ADCON2           EQU  H'03F5'
ADCON3           EQU  H'03F6'
ADSTAT           EQU  H'03F7'
ADREF            EQU  H'03F8'
ADACT            EQU  H'03F9'
ADCLK            EQU  H'03FA'
ADCTX            EQU  H'03FB'
ADCSEL1          EQU  H'03FC'
ADCSEL2          EQU  H'03FD'
ADCSEL3          EQU  H'03FE'
ADCSEL4          EQU  H'03FF'
ANSELA           EQU  H'0400'
WPUA             EQU  H'0401'
ODCONA           EQU  H'0402'
SLRCONA          EQU  H'0403'
INLVLA           EQU  H'0404'
IOCAP            EQU  H'0405'
IOCAN            EQU  H'0406'
IOCAF            EQU  H'0407'
ANSELB           EQU  H'0408'
WPUB             EQU  H'0409'
ODCONB           EQU  H'040A'
SLRCONB          EQU  H'040B'
INLVLB           EQU  H'040C'
IOCBP            EQU  H'040D'
IOCBN            EQU  H'040E'
IOCBF            EQU  H'040F'
ANSELC           EQU  H'0410'
WPUC             EQU  H'0411'
ODCONC           EQU  H'0412'
SLRCONC          EQU  H'0413'
INLVLC           EQU  H'0414'
IOCCP            EQU  H'0415'
IOCCN            EQU  H'0416'
IOCCF            EQU  H'0417'
ANSELD           EQU  H'0418'
WPUD             EQU  H'0419'
ODCOND           EQU  H'041A'
SLRCOND          EQU  H'041B'
INLVLD           EQU  H'041C'
ANSELE           EQU  H'0420'
WPUE             EQU  H'0421'
ODCONE           EQU  H'0422'
SLRCONE          EQU  H'0423'
INLVLE           EQU  H'0424'
IOCEP            EQU  H'0425'
IOCEN            EQU  H'0426'
IOCEF            EQU  H'0427'
NCO1ACC          EQU  H'0440'
NCO1ACCL         EQU  H'0440'
NCO1ACCH         EQU  H'0441'
NCO1ACCU         EQU  H'0442'
NCO1INC          EQU  H'0443'
NCO1INCL         EQU  H'0443'
NCO1INCH         EQU  H'0444'
NCO1INCU         EQU  H'0445'
NCO1CON          EQU  H'0446'
NCO1CLK          EQU  H'0447'
NCO2ACC          EQU  H'0448'
NCO2ACCL         EQU  H'0448'
NCO2ACCH         EQU  H'0449'
NCO2ACCU         EQU  H'044A'
NCO2INC          EQU  H'044B'
NCO2INCL         EQU  H'044B'
NCO2INCH         EQU  H'044C'
NCO2INCU         EQU  H'044D'
NCO2CON          EQU  H'044E'
NCO2CLK          EQU  H'044F'
NCO3ACC          EQU  H'0450'
NCO3ACCL         EQU  H'0450'
NCO3ACCH         EQU  H'0451'
NCO3ACCU         EQU  H'0452'
NCO3INC          EQU  H'0453'
NCO3INCL         EQU  H'0453'
NCO3INCH         EQU  H'0454'
NCO3INCU         EQU  H'0455'
NCO3CON          EQU  H'0456'
NCO3CLK          EQU  H'0457'
FSCMCON          EQU  H'0458'
IVTLOCK          EQU  H'0459'
IVTAD            EQU  H'045A'
IVTADL           EQU  H'045A'
IVTADH           EQU  H'045B'
IVTADU           EQU  H'045C'
IVTBASE          EQU  H'045D'
IVTBASEL         EQU  H'045D'
IVTBASEH         EQU  H'045E'
IVTBASEU         EQU  H'045F'
PWM1ERS          EQU  H'0460'
PWM1CLK          EQU  H'0461'
PWM1LDS          EQU  H'0462'
PWM1PR           EQU  H'0463'
PWM1PRL          EQU  H'0463'
PWM1PRH          EQU  H'0464'
PWM1CPRE         EQU  H'0465'
PWM1PIPOS        EQU  H'0466'
PWM1GIR          EQU  H'0467'
PWM1GIE          EQU  H'0468'
PWM1CON          EQU  H'0469'
PWM1S1CFG        EQU  H'046A'
PWM1S1P1         EQU  H'046B'
PWM1S1P1L        EQU  H'046B'
PWM1S1P1H        EQU  H'046C'
PWM1S1P2         EQU  H'046D'
PWM1S1P2L        EQU  H'046D'
PWM1S1P2H        EQU  H'046E'
PWM2ERS          EQU  H'046F'
PWM2CLK          EQU  H'0470'
PWM2LDS          EQU  H'0471'
PWM2PR           EQU  H'0472'
PWM2PRL          EQU  H'0472'
PWM2PRH          EQU  H'0473'
PWM2CPRE         EQU  H'0474'
PWM2PIPOS        EQU  H'0475'
PWM2GIR          EQU  H'0476'
PWM2GIE          EQU  H'0477'
PWM2CON          EQU  H'0478'
PWM2S1CFG        EQU  H'0479'
PWM2S1P1         EQU  H'047A'
PWM2S1P1L        EQU  H'047A'
PWM2S1P1H        EQU  H'047B'
PWM2S1P2         EQU  H'047C'
PWM2S1P2L        EQU  H'047C'
PWM2S1P2H        EQU  H'047D'
PWM3ERS          EQU  H'047E'
PWM3CLK          EQU  H'047F'
PWM3LDS          EQU  H'0480'
PWM3PR           EQU  H'0481'
PWM3PRL          EQU  H'0481'
PWM3PRH          EQU  H'0482'
PWM3CPRE         EQU  H'0483'
PWM3PIPOS        EQU  H'0484'
PWM3GIR          EQU  H'0485'
PWM3GIE          EQU  H'0486'
PWM3CON          EQU  H'0487'
PWM3S1CFG        EQU  H'0488'
PWM3S1P1         EQU  H'0489'
PWM3S1P1L        EQU  H'0489'
PWM3S1P1H        EQU  H'048A'
PWM3S1P2         EQU  H'048B'
PWM3S1P2L        EQU  H'048B'
PWM3S1P2H        EQU  H'048C'
PWM4ERS          EQU  H'048D'
PWM4CLK          EQU  H'048E'
PWM4LDS          EQU  H'048F'
PWM4PR           EQU  H'0490'
PWM4PRL          EQU  H'0490'
PWM4PRH          EQU  H'0491'
PWM4CPRE         EQU  H'0492'
PWM4PIPOS        EQU  H'0493'
PWM4GIR          EQU  H'0494'
PWM4GIE          EQU  H'0495'
PWM4CON          EQU  H'0496'
PWM4S1CFG        EQU  H'0497'
PWM4S1P1         EQU  H'0498'
PWM4S1P1L        EQU  H'0498'
PWM4S1P1H        EQU  H'0499'
PWM4S1P2         EQU  H'049A'
PWM4S1P2L        EQU  H'049A'
PWM4S1P2H        EQU  H'049B'
PWMLOAD          EQU  H'049C'
PWMEN            EQU  H'049D'
PIE0             EQU  H'049E'
PIE1             EQU  H'049F'
PIE2             EQU  H'04A0'
PIE3             EQU  H'04A1'
PIE4             EQU  H'04A2'
PIE5             EQU  H'04A3'
PIE6             EQU  H'04A4'
PIE7             EQU  H'04A5'
PIE8             EQU  H'04A6'
PIE9             EQU  H'04A7'
PIE10            EQU  H'04A8'
PIE11            EQU  H'04A9'
PIE12            EQU  H'04AA'
PIE13            EQU  H'04AB'
PIE14            EQU  H'04AC'
PIE15            EQU  H'04AD'
PIR0             EQU  H'04AE'
PIR1             EQU  H'04AF'
PIR2             EQU  H'04B0'
PIR3             EQU  H'04B1'
PIR4             EQU  H'04B2'
PIR5             EQU  H'04B3'
PIR6             EQU  H'04B4'
PIR7             EQU  H'04B5'
PIR8             EQU  H'04B6'
PIR9             EQU  H'04B7'
PIR10            EQU  H'04B8'
PIR11            EQU  H'04B9'
PIR12            EQU  H'04BA'
PIR13            EQU  H'04BB'
PIR14            EQU  H'04BC'
PIR15            EQU  H'04BD'
LATA             EQU  H'04BE'
LATB             EQU  H'04BF'
LATC             EQU  H'04C0'
LATD             EQU  H'04C1'
LATE             EQU  H'04C2'
TRISA            EQU  H'04C6'
TRISB            EQU  H'04C7'
TRISC            EQU  H'04C8'
TRISD            EQU  H'04C9'
TRISE            EQU  H'04CA'
PORTA            EQU  H'04CE'
PORTB            EQU  H'04CF'
PORTC            EQU  H'04D0'
PORTD            EQU  H'04D1'
PORTE            EQU  H'04D2'
INTCON0          EQU  H'04D6'
INTCON1          EQU  H'04D7'
STATUS           EQU  H'04D8'
; SFR=FSR2,4D9,16 is a reserved word
FSR2L            EQU  H'04D9'
FSR2H            EQU  H'04DA'
PLUSW2           EQU  H'04DB'
PREINC2          EQU  H'04DC'
POSTDEC2         EQU  H'04DD'
POSTINC2         EQU  H'04DE'
INDF2            EQU  H'04DF'
BSR              EQU  H'04E0'
; SFR=FSR1,4E1,16 is a reserved word
FSR1L            EQU  H'04E1'
FSR1H            EQU  H'04E2'
PLUSW1           EQU  H'04E3'
PREINC1          EQU  H'04E4'
POSTDEC1         EQU  H'04E5'
POSTINC1         EQU  H'04E6'
INDF1            EQU  H'04E7'
WREG             EQU  H'04E8'
; SFR=W,4E8,8 is a reserved word
; SFR=FSR0,4E9,16 is a reserved word
FSR0L            EQU  H'04E9'
FSR0H            EQU  H'04EA'
PLUSW0           EQU  H'04EB'
PREINC0          EQU  H'04EC'
POSTDEC0         EQU  H'04ED'
POSTINC0         EQU  H'04EE'
INDF0            EQU  H'04EF'
PCON0            EQU  H'04F0'
PCON1            EQU  H'04F1'
CPUDOZE          EQU  H'04F2'
PROD             EQU  H'04F3'
PRODL            EQU  H'04F3'
PRODH            EQU  H'04F4'
TABLAT           EQU  H'04F5'
TBLPTR           EQU  H'04F6'
TBLPTRL          EQU  H'04F6'
TBLPTRH          EQU  H'04F7'
TBLPTRU          EQU  H'04F8'
PCLAT            EQU  H'04F9'
PCL              EQU  H'04F9'
PCLATH           EQU  H'04FA'
PCLATU           EQU  H'04FB'
STKPTR           EQU  H'04FC'
TOS              EQU  H'04FD'
TOSL             EQU  H'04FD'
TOSH             EQU  H'04FE'
TOSU             EQU  H'04FF'


;----- BOOTREG Bits -----------------------------------------------------
B0               EQU  H'0000'
B1               EQU  H'0001'
B2               EQU  H'0002'
B3               EQU  H'0003'
B4               EQU  H'0004'
B5               EQU  H'0005'
BOOTDONE         EQU  H'0006'
BPOUT            EQU  H'0007'


