GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q84.inc
;----- SPI2TCNT Bits -----------------------------------------------------


;----- SPI2TCNTH Bits -----------------------------------------------------
TCNTH0           EQU  H'0000'
TCNTH1           EQU  H'0001'
TCNTH2           EQU  H'0002'


;----- SPI2CON0 Bits -----------------------------------------------------
BMODE            EQU  H'0000'
MST              EQU  H'0001'
LSBF             EQU  H'0002'
EN               EQU  H'0007'
SPI2BMODE        EQU  H'0000'
SPI2MST          EQU  H'0001'
SPI2LSBF         EQU  H'0002'
SPI2SPIEN        EQU  H'0007'


;----- SPI2CON1 Bits -----------------------------------------------------
SDOP             EQU  H'0000'
SDIP             EQU  H'0001'
SSP              EQU  H'0002'
FST              EQU  H'0004'
CKP              EQU  H'0005'
CKE              EQU  H'0006'
SMP              EQU  H'0007'
SPI2SDOP         EQU  H'0000'
SPI2SDIP         EQU  H'0001'
SPI2SSP          EQU  H'0002'
SPI2FST          EQU  H'0004'
SPI2CKP          EQU  H'0005'
SPI2CKE          EQU  H'0006'
SPI2SMP          EQU  H'0007'


;----- SPI2CON2 Bits -----------------------------------------------------
RXR              EQU  H'0000'
TXR              EQU  H'0001'
SSET             EQU  H'0002'
SSFLT            EQU  H'0006'
BUSY_SPI2CON2    EQU  H'0007'
SPI2RXR          EQU  H'0000'
SPI2TXR          EQU  H'0001'
SPI2SSET         EQU  H'0002'
SPI2SSFLT        EQU  H'0006'
SPI2BUSY         EQU  H'0007'


;----- SPI2STATUS Bits -----------------------------------------------------
RXBF             EQU  H'0000'
CLRBF            EQU  H'0002'
RXRE             EQU  H'0003'
TXBE             EQU  H'0005'
TXWE             EQU  H'0007'
SPI2RXBF         EQU  H'0000'
SPI2CLRBF        EQU  H'0002'
SPI2RXRE         EQU  H'0003'
SPI2TXBE         EQU  H'0005'
SPI2TXWE         EQU  H'0007'


;----- SPI2TWIDTH Bits -----------------------------------------------------
TWIDTH0          EQU  H'0000'
TWIDTH1          EQU  H'0001'
TWIDTH2          EQU  H'0002'
TWIDTH0          EQU  H'0000'
TWIDTH1          EQU  H'0001'
TWIDTH2          EQU  H'0002'


;----- SPI2BAUD Bits -----------------------------------------------------
BAUD0            EQU  H'0000'
BAUD1            EQU  H'0001'
BAUD2            EQU  H'0002'
BAUD3            EQU  H'0003'
BAUD4            EQU  H'0004'
BAUD5            EQU  H'0005'
BAUD6            EQU  H'0006'
BAUD7            EQU  H'0007'


;----- SPI2INTF Bits -----------------------------------------------------
TXUIF            EQU  H'0001'
RXOIF            EQU  H'0002'
EOSIF            EQU  H'0004'
SOSIF            EQU  H'0005'
TCZIF            EQU  H'0006'
SRMTIF           EQU  H'0007'
SPI2TXUIF        EQU  H'0001'
SPI2RXOIF        EQU  H'0002'
SPI2EOSIF        EQU  H'0004'
SPI2SOSIF        EQU  H'0005'
SPI2TCZIF        EQU  H'0006'
SPI2SRMTIF       EQU  H'0007'


;----- SPI2INTE Bits -----------------------------------------------------
TXUIE            EQU  H'0001'
RXOIE            EQU  H'0002'
EOSIE            EQU  H'0004'
SOSIE            EQU  H'0005'
TCZIE            EQU  H'0006'
SRMTIE           EQU  H'0007'
SPI2TXUIE        EQU  H'0001'
SPI2RXOIE        EQU  H'0002'
SPI2EOSIE        EQU  H'0004'
SPI2SOSIE        EQU  H'0005'
SPI2TCZIE        EQU  H'0006'
SPI2SRMTIE       EQU  H'0007'


;----- SPI2CLK Bits -----------------------------------------------------
CLKSEL0          EQU  H'0000'
CLKSEL1          EQU  H'0001'
CLKSEL2          EQU  H'0002'
CLKSEL3          EQU  H'0003'
CLKSEL4          EQU  H'0004'
SPI2CLKSEL0      EQU  H'0000'
SPI2CLKSEL1      EQU  H'0001'
SPI2CLKSEL2      EQU  H'0002'
SPI2CLKSEL3      EQU  H'0003'
SPI2CLKSEL4      EQU  H'0004'


;----- ACTCON Bits -----------------------------------------------------
ACTORS           EQU  H'0001'
ACTLOCK          EQU  H'0003'
ACTUD            EQU  H'0006'
ACTEN            EQU  H'0007'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- OSCCON2 Bits -----------------------------------------------------
CDIV0            EQU  H'0000'
CDIV1            EQU  H'0001'
CDIV2            EQU  H'0002'
CDIV3            EQU  H'0003'
COSC0            EQU  H'0004'
COSC1            EQU  H'0005'
COSC2            EQU  H'0006'
CDIV0            EQU  H'0000'
CDIV1            EQU  H'0001'
CDIV2            EQU  H'0002'
CDIV3            EQU  H'0003'
COSC0            EQU  H'0004'
COSC1            EQU  H'0005'
COSC2            EQU  H'0006'


;----- OSCCON3 Bits -----------------------------------------------------
NOSCR            EQU  H'0003'
ORDY             EQU  H'0004'
SOSCPWR          EQU  H'0006'
CSWHOLD          EQU  H'0007'


;----- OSCTUNE Bits -----------------------------------------------------
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'


;----- OSCFRQ Bits -----------------------------------------------------
HFFRQ0           EQU  H'0000'
HFFRQ1           EQU  H'0001'
HFFRQ2           EQU  H'0002'
HFFRQ3           EQU  H'0003'
FRQ0             EQU  H'0000'
FRQ1             EQU  H'0001'
FRQ2             EQU  H'0002'
FRQ3             EQU  H'0003'


;----- OSCSTAT Bits -----------------------------------------------------
PLLR             EQU  H'0000'
ADOR             EQU  H'0002'
SOR              EQU  H'0003'
LFOR             EQU  H'0004'
MFOR             EQU  H'0005'
HFOR             EQU  H'0006'
EXTOR            EQU  H'0007'


