GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q84.inc
;----- DMANSPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


;----- DMANSSZ Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'


;----- DMANSSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'


;----- DMANSSA Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


;----- DMANSSAH Bits -----------------------------------------------------
SSA8             EQU  H'0000'
SSA9             EQU  H'0001'
SSA10            EQU  H'0002'
SSA11            EQU  H'0003'
SSA12            EQU  H'0004'
SSA13            EQU  H'0005'
SSA14            EQU  H'0006'
SSA15            EQU  H'0007'


;----- DMANSSAU Bits -----------------------------------------------------
SSA16            EQU  H'0000'
SSA17            EQU  H'0001'
SSA18            EQU  H'0002'
SSA19            EQU  H'0003'
SSA20            EQU  H'0004'
SSA21            EQU  H'0005'


;----- DMANCON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'


;----- DMANCON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
SMODE0           EQU  H'0001'
SMODE1           EQU  H'0002'
SMR0             EQU  H'0003'
SMR1             EQU  H'0004'
DSTP             EQU  H'0005'
DMODE0           EQU  H'0006'
DMODE1           EQU  H'0007'


;----- DMANAIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'
AIRQ7            EQU  H'0007'


;----- DMANSIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'
SIRQ7            EQU  H'0007'


;----- C1CONL Bits -----------------------------------------------------
DNCNT0           EQU  H'0000'
DNCNT1           EQU  H'0001'
DNCNT2           EQU  H'0002'
DNCNT3           EQU  H'0003'
DNCNT4           EQU  H'0004'
ISOCRCEN         EQU  H'0005'
PXEDIS           EQU  H'0006'
CLKSEL0          EQU  H'0007'
DNCNT0           EQU  H'0000'
DNCNT1           EQU  H'0001'
DNCNT2           EQU  H'0002'
DNCNT3           EQU  H'0003'
DNCNT4           EQU  H'0004'


;----- C1CONH Bits -----------------------------------------------------
WAKFIL           EQU  H'0000'
WFT0             EQU  H'0001'
WFT1             EQU  H'0002'
BUSY_C1CONH      EQU  H'0003'
BRSDIS           EQU  H'0004'
SIDL             EQU  H'0005'
FRZ              EQU  H'0006'
ON_C1CONH        EQU  H'0007'
WFT0             EQU  H'0001'
WFT1             EQU  H'0002'


;----- C1CONU Bits -----------------------------------------------------
RTXAT            EQU  H'0000'
ESIGM            EQU  H'0001'
SERR2LOM         EQU  H'0002'
STEF             EQU  H'0003'
TXQEN            EQU  H'0004'
OPMOD0           EQU  H'0005'
OPMOD1           EQU  H'0006'
OPMOD2           EQU  H'0007'
OPMOD0           EQU  H'0005'
OPMOD1           EQU  H'0006'
OPMOD2           EQU  H'0007'


;----- C1CONT Bits -----------------------------------------------------
REQOP0           EQU  H'0000'
REQOP1           EQU  H'0001'
REQOP2           EQU  H'0002'
ABAT             EQU  H'0003'
TXBWS0           EQU  H'0004'
TXBWS1           EQU  H'0005'
TXBWS2           EQU  H'0006'
TXBWS3           EQU  H'0007'
REQOP0           EQU  H'0000'
REQOP1           EQU  H'0001'
REQOP2           EQU  H'0002'
TXBWS0           EQU  H'0004'
TXBWS1           EQU  H'0005'
TXBWS2           EQU  H'0006'
TXBWS3           EQU  H'0007'


;----- C1NBTCFGL Bits -----------------------------------------------------
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW4             EQU  H'0004'
SJW5             EQU  H'0005'
SJW6             EQU  H'0006'
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW4             EQU  H'0004'
SJW5             EQU  H'0005'
SJW6             EQU  H'0006'


;----- C1NBTCFGH Bits -----------------------------------------------------
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG24           EQU  H'0004'
TSEG25           EQU  H'0005'
TSEG26           EQU  H'0006'
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG24           EQU  H'0004'
TSEG25           EQU  H'0005'
TSEG26           EQU  H'0006'


;----- C1NBTCFGU Bits -----------------------------------------------------
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'
TSEG15           EQU  H'0005'
TSEG16           EQU  H'0006'
TSEG17           EQU  H'0007'


