GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q84.inc
;----- U4FIFO Bits -----------------------------------------------------
RXBF             EQU  H'0000'
RXBE             EQU  H'0001'
XON              EQU  H'0002'
RXIDL            EQU  H'0003'
TXBF             EQU  H'0004'
TXBE             EQU  H'0005'
STPMD            EQU  H'0006'
TXWRE            EQU  H'0007'
U4RXBF           EQU  H'0000'
U4RXBE           EQU  H'0001'
U4XON            EQU  H'0002'
U4RXIDL          EQU  H'0003'
U4TXBF           EQU  H'0004'
U4TXBE           EQU  H'0005'
U4STPMD          EQU  H'0006'
U4TXWRE          EQU  H'0007'
U4RCIDL          EQU  H'0003'
RCIDL            EQU  H'0003'


;----- U4UIR Bits -----------------------------------------------------
ABDIE            EQU  H'0002'
ABDIF            EQU  H'0006'
WUIF             EQU  H'0007'
U4ABDIE          EQU  H'0002'
U4ABDIF          EQU  H'0006'
U4WUIF           EQU  H'0007'


;----- U4ERRIR Bits -----------------------------------------------------
TXCIF            EQU  H'0000'
RXFOIF           EQU  H'0001'
RXBKIF           EQU  H'0002'
FERIF            EQU  H'0003'
CERIF            EQU  H'0004'
ABDOVF           EQU  H'0005'
PERIF            EQU  H'0006'
TXMTIF           EQU  H'0007'
U4TXCIF          EQU  H'0000'
U4RXFOIF         EQU  H'0001'
U4RXBKIF         EQU  H'0002'
U4FERIF          EQU  H'0003'
U4CERIF          EQU  H'0004'
U4ABDOVF         EQU  H'0005'
U4PERIF          EQU  H'0006'
U4TXMTIF         EQU  H'0007'


;----- U4ERRIE Bits -----------------------------------------------------
TXCIE            EQU  H'0000'
RXFOIE           EQU  H'0001'
RXBKIE           EQU  H'0002'
FERIE            EQU  H'0003'
CERIE            EQU  H'0004'
ABDOVE           EQU  H'0005'
PERIE            EQU  H'0006'
TXMTIE           EQU  H'0007'
U4TXCIE          EQU  H'0000'
U4RXFOIE         EQU  H'0001'
U4RXBKIE         EQU  H'0002'
U4FERIE          EQU  H'0003'
U4CERIE          EQU  H'0004'
U4ABDOVE         EQU  H'0005'
U4PERIE          EQU  H'0006'
U4TXMTIE         EQU  H'0007'


;----- U5RXB Bits -----------------------------------------------------


;----- U5TXB Bits -----------------------------------------------------


;----- U5P1 Bits -----------------------------------------------------


;----- U5P2 Bits -----------------------------------------------------


;----- U5P3 Bits -----------------------------------------------------


;----- U5CON0 Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
U5MODE0          EQU  H'0000'
U5MODE1          EQU  H'0001'
U5MODE2          EQU  H'0002'
U5MODE3          EQU  H'0003'
U5RXEN           EQU  H'0004'
U5TXEN           EQU  H'0005'
U5ABDEN          EQU  H'0006'
U5BRGS           EQU  H'0007'
U5MODE0          EQU  H'0000'
U5MODE1          EQU  H'0001'
U5MODE2          EQU  H'0002'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
RXEN             EQU  H'0004'
TXEN             EQU  H'0005'
ABDEN            EQU  H'0006'
BRGS             EQU  H'0007'


;----- U5CON1 Bits -----------------------------------------------------
SENDB            EQU  H'0000'
BRKOVR           EQU  H'0001'
RXBIMD           EQU  H'0003'
WUE              EQU  H'0004'
ON_U5CON1        EQU  H'0007'
U5SENDB          EQU  H'0000'
U5BRKOVR         EQU  H'0001'
U5RXBIMD         EQU  H'0003'
U5WUE            EQU  H'0004'
U5ON             EQU  H'0007'


;----- U5CON2 Bits -----------------------------------------------------
FLO0             EQU  H'0000'
FLO1             EQU  H'0001'
TXPOL            EQU  H'0002'
STP0             EQU  H'0004'
STP1             EQU  H'0005'
RXPOL            EQU  H'0006'
RUNOVF           EQU  H'0007'
FLO0             EQU  H'0000'
FLO1             EQU  H'0001'
STP0             EQU  H'0004'
STP1             EQU  H'0005'
U5FLO0           EQU  H'0000'
U5FLO1           EQU  H'0001'
U5TXPOL          EQU  H'0002'
U5STP0           EQU  H'0004'
U5STP1           EQU  H'0005'
U5RXPOL          EQU  H'0006'
U5RUNOVF         EQU  H'0007'
U5FLO0           EQU  H'0000'
U5FLO1           EQU  H'0001'
U5STP0           EQU  H'0004'
U5STP1           EQU  H'0005'


;----- U5BRG Bits -----------------------------------------------------


;----- U5BRGH Bits -----------------------------------------------------


;----- U5FIFO Bits -----------------------------------------------------
RXBF             EQU  H'0000'
RXBE             EQU  H'0001'
XON              EQU  H'0002'
RXIDL            EQU  H'0003'
TXBF             EQU  H'0004'
TXBE             EQU  H'0005'
STPMD            EQU  H'0006'
TXWRE            EQU  H'0007'
U5RXBF           EQU  H'0000'
U5RXBE           EQU  H'0001'
U5XON            EQU  H'0002'
U5RXIDL          EQU  H'0003'
U5TXBF           EQU  H'0004'
U5TXBE           EQU  H'0005'
U5STPMD          EQU  H'0006'
U5TXWRE          EQU  H'0007'
U5RCIDL          EQU  H'0003'
RCIDL            EQU  H'0003'


;----- U5UIR Bits -----------------------------------------------------
ABDIE            EQU  H'0002'
ABDIF            EQU  H'0006'
WUIF             EQU  H'0007'
U5ABDIE          EQU  H'0002'
U5ABDIF          EQU  H'0006'
U5WUIF           EQU  H'0007'


;----- U5ERRIR Bits -----------------------------------------------------
TXCIF            EQU  H'0000'
RXFOIF           EQU  H'0001'
RXBKIF           EQU  H'0002'
FERIF            EQU  H'0003'
CERIF            EQU  H'0004'
ABDOVF           EQU  H'0005'
PERIF            EQU  H'0006'
TXMTIF           EQU  H'0007'
U5TXCIF          EQU  H'0000'
U5RXFOIF         EQU  H'0001'
U5RXBKIF         EQU  H'0002'
U5FERIF          EQU  H'0003'
U5CERIF          EQU  H'0004'
U5ABDOVF         EQU  H'0005'
U5PERIF          EQU  H'0006'
U5TXMTIF         EQU  H'0007'


;----- U5ERRIE Bits -----------------------------------------------------
TXCIE            EQU  H'0000'
RXFOIE           EQU  H'0001'
RXBKIE           EQU  H'0002'
FERIE            EQU  H'0003'
CERIE            EQU  H'0004'
ABDOVE           EQU  H'0005'
PERIE            EQU  H'0006'
TXMTIE           EQU  H'0007'
U5TXCIE          EQU  H'0000'
U5RXFOIE         EQU  H'0001'
U5RXBKIE         EQU  H'0002'
U5FERIE          EQU  H'0003'
U5CERIE          EQU  H'0004'
U5ABDOVE         EQU  H'0005'
U5PERIE          EQU  H'0006'
U5TXMTIE         EQU  H'0007'


;----- SMT1TMR Bits -----------------------------------------------------
TMR0             EQU  H'0000'
TMR1             EQU  H'0001'
TMR2             EQU  H'0002'
TMR3             EQU  H'0003'
TMR4             EQU  H'0004'
TMR5             EQU  H'0005'
TMR6             EQU  H'0006'
TMR7             EQU  H'0007'
SMT1TMR0         EQU  H'0000'
SMT1TMR1         EQU  H'0001'
SMT1TMR2         EQU  H'0002'
SMT1TMR3         EQU  H'0003'
SMT1TMR4         EQU  H'0004'
SMT1TMR5         EQU  H'0005'
SMT1TMR6         EQU  H'0006'
SMT1TMR7         EQU  H'0007'


;----- SMT1TMRH Bits -----------------------------------------------------
TMR8             EQU  H'0000'
TMR9             EQU  H'0001'
TMR10            EQU  H'0002'
TMR11            EQU  H'0003'
TMR12            EQU  H'0004'
TMR13            EQU  H'0005'
TMR14            EQU  H'0006'
TMR15            EQU  H'0007'
SMT1TMR8         EQU  H'0000'
SMT1TMR9         EQU  H'0001'
SMT1TMR10        EQU  H'0002'
SMT1TMR11        EQU  H'0003'
SMT1TMR12        EQU  H'0004'
SMT1TMR13        EQU  H'0005'
SMT1TMR14        EQU  H'0006'
SMT1TMR15        EQU  H'0007'


;----- SMT1TMRU Bits -----------------------------------------------------
TMR16            EQU  H'0000'
TMR17            EQU  H'0001'
TMR18            EQU  H'0002'
TMR19            EQU  H'0003'
TMR20            EQU  H'0004'
TMR21            EQU  H'0005'
TMR22            EQU  H'0006'
TMR23            EQU  H'0007'
SMT1TMR16        EQU  H'0000'
SMT1TMR17        EQU  H'0001'
SMT1TMR18        EQU  H'0002'
SMT1TMR19        EQU  H'0003'
SMT1TMR20        EQU  H'0004'
SMT1TMR21        EQU  H'0005'
SMT1TMR22        EQU  H'0006'
SMT1TMR23        EQU  H'0007'


;----- SMT1CPR Bits -----------------------------------------------------
CPR0             EQU  H'0000'
CPR1             EQU  H'0001'
CPR2             EQU  H'0002'
CPR3             EQU  H'0003'
CPR4             EQU  H'0004'
CPR5             EQU  H'0005'
CPR6             EQU  H'0006'
CPR7             EQU  H'0007'
SMT1CPR0         EQU  H'0000'
SMT1CPR1         EQU  H'0001'
SMT1CPR2         EQU  H'0002'
SMT1CPR3         EQU  H'0003'
SMT1CPR4         EQU  H'0004'
SMT1CPR5         EQU  H'0005'
SMT1CPR6         EQU  H'0006'
SMT1CPR7         EQU  H'0007'


